---
kind: enumMember
id: F:Autodesk.Revit.DB.IFCExportElementType.Default
enum: Autodesk.Revit.DB.IFCExportElementType
source: html/981a88ab-534d-edac-94a1-ab8e790d1712.htm
---
# Autodesk.Revit.DB.IFCExportElementType.Default

Export element type to IFC according to category or Revit element settings.